MemMaoxin/nrf52832_ble_peripheral/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}




#define CS 18//8
#define SCLOCK 15//18
#define DIN 8//0
#define DOUT 6//5 



/*
  * CS - to digital pin 13  (CS pin)
  * SCLOCK - to digital pin 14 (CLK pin)
  * DIN - to digital pin 11 (MOSI pin)
  * DOUT - to digital pin 12 (MISO pin)
*/

//void WriteToReg(uint8_t ByteData);
//void ReadFromReg(unsigned int nByte,uint8_t *DataRead);
void Delay(unsigned int Time)
{
    nrf_delay_us(Time);
}

void AD_reset()
{
    /* PRECONFIGURE...*/
    nrf_gpio_pin_set(SCLOCK);
    nrf_gpio_pin_clear(CS); //to keep DIN=1 for 32 sclock to reset the part
    nrf_gpio_pin_set(DIN);
    int ResetTime = 32;
    while (ResetTime--)
    {
        Delay(20);
        nrf_gpio_pin_clear(SCLOCK);
        Delay(20);
        nrf_gpio_pin_set(SCLOCK);
    }
    nrf_gpio_pin_set(CS);

//    NRF_LOG_INFO("Reset\r\n");
    Delay(1000);
    
}

void WriteToReg(uint8_t ByteData) // write ByteData to the register
{
    uint8_t temp;
    int i;
    nrf_gpio_pin_clear(CS);
    temp = 0x80;
    for (i = 0; i < 8; i++)
    {
        if ((temp & ByteData) == 0)
        {
            nrf_gpio_pin_clear(DIN);
        }
        else
        {
            nrf_gpio_pin_set(DIN);
        }
        nrf_gpio_pin_clear(SCLOCK);
        Delay(20);
        nrf_gpio_pin_set(SCLOCK);
        Delay(20);
        temp = temp >> 1;
    }
    nrf_gpio_pin_set(CS);

}

void setup()
{
    // set the slaveSelectPin as an output:
    
    nrf_gpio_cfg_output(CS);
    nrf_gpio_cfg_output(SCLOCK);
    nrf_gpio_cfg_input(DOUT,NRF_GPIO_PIN_NOPULL);
    nrf_gpio_cfg_output(DIN);

    AD_reset();
    WriteToReg(0x10); //write to Communication register.The next step is writing to Configuration register.
    WriteToReg(0x10); //set the Configuration unipolar mode.Gain=1.
    WriteToReg(0x00); //Configuration internal reference selected.1.17v
}


void ReadFromReg(unsigned int nByte,uint8_t *DataRead) // nByte is the number of bytes which need to be read
{
    int i, j;
    uint16_t temp;
    nrf_gpio_pin_set(DIN);
    nrf_gpio_pin_clear(CS);
		nrf_gpio_pin_set(SCLOCK);
		Delay(20);

    temp = 0x0000;

    for (i = 0; i < nByte; i++)
    {
        for (j = 0; j < 8; j++)
        {
            nrf_gpio_pin_clear(SCLOCK);
					  Delay(20);
            if (nrf_gpio_pin_read(DOUT) == 0x0)

					  {
                temp = temp << 1;
            }
            else
            {
                temp = temp << 1;
                temp = temp + 0x01;
            }
            
            nrf_gpio_pin_set(SCLOCK);
            Delay(20);
        }

	        DataRead[i] = temp;			
//        DataRead[i] = temp;
        temp = 0x0000;
    }
		
    nrf_gpio_pin_set(CS);
}



static void thi_monitor_handler(void)
{
	   // NRF_LOG_INFO("Working Normally");
  uint32_t err_code;
  int Rref=100;
		uint8_t DataRead[3];
//	uint8_t check;
 //       WriteToReg(0x40); //write to Communication register.The next step is to read from Status register.
  //      ReadFromReg(1, DataRead);
//	NRF_LOG_INFO("DATAstate:%x ",DataRead[0]);
 //       while ((DataRead[0] & 0x80) == 0x80) //wait for the end of convertion by polling the status register RDY bit
 //       {
 //               WriteToReg(0x40);
 //               ReadFromReg(1, DataRead);
//					check=DataRead[0];
	//				NRF_LOG_INFO("DATAstate:%x ",DataRead[0]);
 //       }

        WriteToReg(0x58); //write to Communication register.The next step is to read from Data register.
				Delay(20);
	ReadFromReg(2, DataRead);
	//			NRF_LOG_INFO("DATAxxxxkkk:%x %x",DataRead[0],DataRead[1]);
/*	uint16_t radio=(DataRead[0]<<8) | DataRead[1];
	float R=radio*Rref/(65535-radio);
	float Ro=149;
	float T0=18;
	float  change_radio=0.5;
	float Tnow=T0+(R-Ro)/change_radio;
	uint8_t integer=(int)Tnow;
	uint8_t decimal=(int)((Tnow-integer)*100);
	uint8_t integer0=integer%10;
	uint8_t integer1=(integer%100-integer0)/10;
	DataRead[0]=integer1*16+integer0;
		uint8_t decimal0=decimal%10;
	uint8_t decimal1=(decimal%100-decimal0)/10;
	DataRead[1]=decimal1*16+decimal0;*/
		   err_code = ble_lbs_on_dht_change(&m_nus,DataRead[0],DataRead[1],m_conn_handle);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_INVALID_CONN_HANDLE)&&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)		
        )
    {
     //   app_uart_put((uint8_t)(err_code));
//			  APP_ERROR_HANDLER(err_code);
    }

	 
}

//定时器超时中断操作
static void thi_monitor_timeout_handler(nrf_timer_event_t event_type,void * p_context)
{
	    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE2:
	//NRF_LOG_INFO("Working Normally1");
    thi_monitor_handler();
            break;

        default:
            //Do nothing.
            break;
    }

}
/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init1(void)
{
	  uint32_t err_code;
    // Initialize timer module, making it use the scheduler
 //   APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	
	

	  // 创建一个周期执行的定时器，用于检测温湿度
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, thi_monitor_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


//定时器开始计时，时间间隔1S
/**@brief Function for starting application timers.
 */


static void application_timers_start(void)
{


    uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer, 500);
    nrf_drv_timer_extended_compare(&m_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   true);
    nrf_drv_timer_enable(&m_timer);

	
}





/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
		setup();
    // Initialize.
    uart_init();
    log_init();
    timers_init();

//    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
			timers_init1();
		application_timers_start();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
